UB_Copy/src/Documents/УБ_РасчетЭффективностиСотрудников/УБ_РасчетЭффективностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УБ_РасчетЭффективностиСотрудников</name>
  <registerRecords>AccumulationRegister.УБ_КоэффициентыРаспределенияБезокладнойСистемыПоказателейВакантныхПозиций</registerRecords>
  <registerRecords>AccumulationRegister.УБ_ДанныеПоказателейРасчетаЗарплаты</registerRecords>
  <registerRecords>AccumulationRegister.УБ_ДанныеНачисленийРасчетаЭффективностиСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.УБ_ДанныеИтоговыхНачисленийРасчетаЭффективностиСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.УБ_КоэффициентыРаспределенияБезокладнойСистемыПоказателей</registerRecords>
  <registerRecords>InformationRegister.УБ_СостоянияДокументовРасчетаЭффективностиСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>DefinedType.УБ_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияГрейда</name>
    <type>
      <types>CatalogRef.УБ_ВерсииГрейдов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланУтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактУтвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяОценкаПоСтандартам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаПремии</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаПремии</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчетнойБазы</name>
    <type>
      <types>CatalogRef.УБ_ПоказателиЭффективности</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКРаспределению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредельныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ПоказательЭффективности</name>
      <type>
        <types>CatalogRef.УБ_ПоказателиЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальноеЗначениеРезультата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Эффективность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеЗначениеРасценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеЗначениеВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеЗначениеПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УтвержденноеКритическоеЗначение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитанноеЗначениеФакта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаПоказателей</name>
      <type>
        <types>CatalogRef.УБ_ШкалыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинкиГраницЭффективности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитанноеЗначениеПлана</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИтоговыеНачисления</name>
    <attributes>
      <name>ТипПоказателя</name>
      <type>
        <types>CatalogRef.УБ_ТипыПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Эффективность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыОценкиСотрудника</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.УБ_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаОценок</name>
      <type>
        <types>CatalogRef.УБ_ШкалыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.УБ_ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыОценкиРуководителя</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.УБ_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ШкалаОценок</name>
      <type>
        <types>CatalogRef.УБ_ШкалыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>CatalogRef.УБ_ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеПремииПодразделения</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>DefinedType.УБ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредельныйКоэффициентРЭ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отсутствия</name>
    <attributes>
      <name>ПричинаОтсутствия</name>
      <type>
        <types>CatalogRef.УБ_ПричиныОтсутствия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UB_Copy/src/CommonModules/УБ_РасчетыБезокладнойСистемыКлиентСервер/Module.bsl
Функция РаспределитьСуммуПропорциональноКоэффициентамСПредельнымКоэффициентом(Адрес) Экспорт
	
	РассчитанныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	РаспределитьСуммуПропорциональноКоэффициентомСПредельнымКоэффициентомВспомогательный(РассчитанныеДанные);	
	
	АдресИтог = ПоместитьВоВременноеХранилище(РассчитанныеДанные);
	
	Возврат АдресИтог;
	
КонецФункции

Процедура РаспределитьСуммуПропорциональноКоэффициентомСПредельнымКоэффициентомВспомогательный(СтруктураДляРасчета)
	
	Коэффициенты = Новый Массив;
	Для Каждого СтрокаСотрудника Из СтруктураДляРасчета.СписокДляРаспределения Цикл
		Коэффициенты.Добавить(СтрокаСотрудника.КоэффициентРаспределения);
	КонецЦикла;
	
	Результат = РаспределитьСуммуПропорциональноКоэффициентам(?(СтруктураДляРасчета.СуммаОстаток = 0,СтруктураДляРасчета.СуммаРаспределения,СтруктураДляРасчета.СуммаОстаток),Коэффициенты);
	
	Если Результат <> Неопределено Тогда
		Для Индекс = 0 По Результат.Количество() - 1 Цикл
			СтрокаСотрудника = СтруктураДляРасчета.СписокДляРаспределения[Индекс];
			СтрокаСотрудника.Сумма = Результат[Индекс];
		КонецЦикла;
	КонецЕсли;
	
	МассивРассчитаных = Новый Массив;
	СуммаРассчитаных = 0;
	Для каждого Строка из СтруктураДляРасчета.СписокДляРаспределения Цикл
		Если Строка.ПредельныйКоэффициентРЭ*СтруктураДляРасчета.СуммаРаспределения < Строка.Сумма Тогда
			Строка.Сумма = Строка.ПредельныйКоэффициентРЭ*СтруктураДляРасчета.СуммаРаспределения;
			СуммаРассчитаных = СуммаРассчитаных+Строка.Сумма;
		    МассивРассчитаных.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДляРасчета.СуммаОстаток = ?(СтруктураДляРасчета.СуммаОстаток = 0,СтруктураДляРасчета.СуммаРаспределения,СтруктураДляРасчета.СуммаОстаток) - СуммаРассчитаных;
	
	Для каждого Строка из МассивРассчитаных Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", Строка.Сотрудник);
		Найденный = СтруктураДляРасчета.ТаблицаРасчета.НайтиСтроки(Отбор);
		Найденный[0].Сумма = Строка.Сумма;
		//Найденный = СтруктураДляРасчета.СуммаРаспределения.НайтиСтроки(Отбор);
		СтруктураДляРасчета.СписокДляРаспределения.Удалить(СтруктураДляРасчета.СписокДляРаспределения.Индекс(Строка));
	КонецЦикла;	
	
	Если МассивРассчитаных.Количество() = 0 Тогда
		Для каждого Строка из СтруктураДляРасчета.СписокДляРаспределения Цикл 
		   Отбор = Новый Структура;
			Отбор.Вставить("Сотрудник", Строка.Сотрудник);
			Найденный = СтруктураДляРасчета.ТаблицаРасчета.НайтиСтроки(Отбор);
			Найденный[0].Сумма = Строка.Сумма;
		КонецЦикла;
		СтруктураДляРасчета.СуммаОстаток = СтруктураДляРасчета.СуммаРаспределения - СтруктураДляРасчета.ТаблицаРасчета.Итог("Сумма");
	КонецЕсли;
	
	Если СтруктураДляРасчета.СписокДляРаспределения.Количество() = 0 Тогда
		СтруктураДляРасчета.СуммаОстаток = СтруктураДляРасчета.СуммаРаспределения - СтруктураДляРасчета.ТаблицаРасчета.Итог("Сумма");	
	КонецЕсли;	
	
	Если СтруктураДляРасчета.СписокДляРаспределения.Количество()<>0 И СтруктураДляРасчета.СуммаОстаток>0 Тогда
		РаспределитьСуммуПропорциональноКоэффициентомСПредельнымКоэффициентомВспомогательный(СтруктураДляРасчета);
	КонецЕсли;	
	
		
КонецПроцедуры	

Функция РаспределитьСуммуПропорциональноКоэффициентам(Знач РаспределяемаяСумма, Знач Коэффициенты, Знач Точность = 2) Экспорт
	
	КоэффициентыАбсолютные = Новый Массив(Новый ФиксированныйМассив(Коэффициенты)); // Копируем массив в памяти.
	
	// Старое поведение при неуказанной сумме - для обратной совместимости.
	Если Не ЗначениеЗаполнено(РаспределяемаяСумма) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если КоэффициентыАбсолютные.Количество() = 0 Тогда 
		// Недопустимо значение параметра Коэффициенты
		// Ожидалось: хотя бы один коэффициент будет задан.
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексМаксимальногоКоэффициента = 0;
	МаксимальныйКоэффициент = 0;
	СуммаКоэффициентов = 0;
	КоэффициентыОтрицательны = (КоэффициентыАбсолютные[0] < 0);
	
	Для Индекс = 0 По КоэффициентыАбсолютные.Количество() - 1 Цикл
		Коэффициент = КоэффициентыАбсолютные[Индекс];
		
		Если КоэффициентыОтрицательны И Коэффициент > 0 Тогда 
			// Недопустимо значение параметра Коэффициенты
			// Ожидалось: все коэффициенты положительны или все отрицательны одновременно.
			Возврат Неопределено;
		КонецЕсли;
		
		Если Коэффициент < 0 Тогда 
			// Если коэффициент меньше нуля, то его абсолютное значение отрицательное ему число.
			Коэффициент = -Коэффициент; // Abs(Коэффициент)
			КоэффициентыАбсолютные[Индекс] = Коэффициент; // Заменяем коэффициент в массиве.
		КонецЕсли;
		
		Если МаксимальныйКоэффициент < Коэффициент Тогда
			МаксимальныйКоэффициент = Коэффициент;
			ИндексМаксимальногоКоэффициента = Индекс;
		КонецЕсли;
		
		СуммаКоэффициентов = СуммаКоэффициентов + Коэффициент;
	КонецЦикла;
	
	Если СуммаКоэффициентов = 0 Тогда
		// Недопустимо значение параметра Коэффициенты
		// Ожидалось: хотя бы один коэффициент будет отличен от нуля.
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Массив(КоэффициентыАбсолютные.Количество());
	
	ВыполнятьИнверсию = (РаспределяемаяСумма < 0);
	Если ВыполнятьИнверсию Тогда 
		// Если изначально распределяемая сумма меньше нуля, надо сначала распределить абсолютное значение суммы
		// затем выполнить инверсию результата.
		РаспределяемаяСумма = -РаспределяемаяСумма; // Abs(РаспределяемаяСумма).
	КонецЕсли;
	
	РаспределеннаяСумма = 0;
	
	Для Индекс = 0 По КоэффициентыАбсолютные.Количество() - 1 Цикл
		Результат[Индекс] = Окр(РаспределяемаяСумма * КоэффициентыАбсолютные[Индекс] / СуммаКоэффициентов, Точность, 1);
		РаспределеннаяСумма = РаспределеннаяСумма + Результат[Индекс];
	КонецЦикла;
	
	СуммарнаяПогрешность = РаспределяемаяСумма - РаспределеннаяСумма;
	
	Если СуммарнаяПогрешность > 0 Тогда 
		
		// Погрешности округления отнесем на коэффициент с максимальным весом.
		Если Не РаспределеннаяСумма = РаспределяемаяСумма Тогда
			Результат[ИндексМаксимальногоКоэффициента] = Результат[ИндексМаксимальногоКоэффициента] + СуммарнаяПогрешность;
		КонецЕсли;
		
	ИначеЕсли СуммарнаяПогрешность < 0 Тогда 
		
		// Если распределили больше чем положено, размазываем погрешность по ближайшим максимальным весам.
		ЗначениеПогрешности = 1 / Pow(10, Точность);
		КоличествоЭлементовПогрешности = -СуммарнаяПогрешность / ЗначениеПогрешности;
		
		Для Сч = 1 По КоличествоЭлементовПогрешности Цикл 
			МаксимальныйКоэффициент = МаксимальноеЗначениеВМассиве(КоэффициентыАбсолютные);
			Индекс = КоэффициентыАбсолютные.Найти(МаксимальныйКоэффициент);
			Результат[Индекс] = Результат[Индекс] - ЗначениеПогрешности;
			КоэффициентыАбсолютные[Индекс] = 0;
		КонецЦикла;
		
	Иначе 
		// Если СуммарнаяПогрешность = 0, то все идеально.
	КонецЕсли;
	
	Если ВыполнятьИнверсию Тогда 
		Для Индекс = 0 По КоэффициентыАбсолютные.Количество() - 1 Цикл
			Результат[Индекс] = -Результат[Индекс];
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция МаксимальноеЗначениеВМассиве(Массив)
	
	МаксимальноеЗначение = 0;
	
	Для Индекс = 0 По Массив.Количество() - 1 Цикл
		Значение = Массив[Индекс];
		
		Если МаксимальноеЗначение < Значение Тогда
			МаксимальноеЗначение = Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальноеЗначение;
	
КонецФункции

Функция РассчитатьСуммуОтМаксимумаСПредельнымКоэффициентом(Адрес) Экспорт
	
	РассчитанныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	РассчитатьСуммуОтМаксимумаСПредельнымКоэффициентомВспомогательный(РассчитанныеДанные);
	
	АдресИтог = ПоместитьВоВременноеХранилище(РассчитанныеДанные);
	
	Возврат АдресИтог;
	
КонецФункции

Процедура РассчитатьСуммуОтМаксимумаСПредельнымКоэффициентомВспомогательный(СтруктураДляРасчета)
	
	Для каждого Строка из СтруктураДляРасчета.ТаблицаРасчета Цикл
		
		БальныйКоэффициентЭффективности = ПолучитьМаксисумИРезульитатБальнойСистемы(Строка.РасчетЭффективностиСотрудника);
		МаксимальнаяСумма = СтруктураДляРасчета.СуммаРаспределения*Строка.ПредельныйКоэффициентРЭ;
		Строка.Сумма = МаксимальнаяСумма*БальныйКоэффициентЭффективности;
		
	КонецЦикла;
	
	СтруктураДляРасчета.СуммаОстаток = СтруктураДляРасчета.СуммаРаспределения - СтруктураДляРасчета.ТаблицаРасчета.Итог("Сумма");
	
КонецПроцедуры

Функция ПолучитьМаксисумИРезульитатБальнойСистемы(Документ)
	
	МаксимумБаллов = 0;
	ПолученныеБаллы = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УБ_РасчетЭффективностиСотрудниковНачисления.ТипПоказателя КАК ТипПоказателя,
	               |	УБ_РасчетЭффективностиСотрудниковНачисления.ПоказательЭффективности КАК ПоказательЭффективности,
	               |	УБ_РасчетЭффективностиСотрудниковНачисления.Расценка КАК Расценка,
	               |	УБ_РасчетЭффективностиСотрудниковНачисления.Сумма КАК Сумма
	               |ИЗ
	               |	Документ.УБ_РасчетЭффективностиСотрудников.Начисления КАК УБ_РасчетЭффективностиСотрудниковНачисления
	               |ГДЕ
	               |	УБ_РасчетЭффективностиСотрудниковНачисления.Ссылка = &Документ
	               |	И УБ_РасчетЭффективностиСотрудниковНачисления.ТипПоказателя.ИспользоватьДляРаспределенияКоэффициентовБезокладнойСистемы = ИСТИНА
	               |	И УБ_РасчетЭффективностиСотрудниковНачисления.ПоказательЭффективности.НеУчитыватьВРасчетеПерсональнойЭффективности = ЛОЖЬ";
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МаксимумБаллов = МаксимумБаллов+Выборка.Расценка;
		ПолученныеБаллы = ПолученныеБаллы+Выборка.Сумма;
		
	КонецЦикла;
	
	Возврат ПолученныеБаллы/МаксимумБаллов;
	
	
	
КонецФункции
